SvOlli/sorbus/src/rp2040/jam/bus.c
   // restart if requested
   if( timer_cycle_total[offset] )
   {
      queue_event_add( timer_cycle_total[offset], event_timer_cycle, (void*)offset );
   }
}


static inline void timer_cycle_setup( uint8_t value )
{
   uint8_t config = address & 0x07;
   // config bits (decoded from address)
   //           0        1
   // bit 0: lobyte   hibyte
   // bit 1: repeat   oneshot
   // bit 2: irq      nmi
   uint32_t offset = (config & 4) >> 2;

   if( config & (1<<0) )
   {
      // highbyte: store and start timer
      timer_cycle_total[offset] |= value << 8;
      queue_event_add( timer_cycle_total[offset], event_timer_cycle, (void*)offset );
      if( config & (1<<1) )
      {
         // oneshot
         timer_cycle_total[offset] = 0;
      }
   }
   else
   {
      // lowbyte: store and stop timer
      queue_event_cancel_data( event_timer_cycle, (void*)offset );
      timer_cycle_total[offset] = value;
   }
}


static inline void timer_cycle_ack()
{
   // identift interrupt to work with
   uint32_t offset = (address & 4) >> 2;
   // set bit 7 if interrupt was triggered
   bus_data_write( timer_cycle_triggered[offset] ? 0x80 : 0x00 );

   if( timer_cycle_triggered[offset] )
   {
      timer_cycle_triggered[offset] = false;
      // check if all other interrupt source prevents release
      if( !timer_ms_triggered[offset] )
      {
         gpio_set_mask( bus_config.mask_nmi );
      }
   }
}


static bool callback_timer_ms( struct repeating_timer *t )
{
   uint32_t offset = (uint32_t)t->user_data;

   timer_ms_triggered[offset] = true;
   gpio_clr_mask( timer_mask[offset] );

   return true;
}


static inline void timer_ms_setup( uint8_t value )
{
   uint8_t config = address & 0x03;

   uint32_t offset = ((config & 2) >> 1);
   struct repeating_timer *t = &timer_ms[offset];
   uint16_t *tv = (uint16_t*)&ram[address & 0xFFFE];

   // using RAM to store config
   handle_ramrom();

   cancel_repeating_timer( t );

   if( *tv )
   {
      add_repeating_timer_us( -100 * (*tv), callback_timer_ms, (void*)offset, t );
   }
}


static inline void timer_ms_ack()
{
   uint8_t config = address & 0x03;
   // identift interrupt to work with
   uint32_t offset = ((config & 2) >> 1);
   // set bit 7 if interrupt was triggered
   bus_data_write( timer_ms_triggered[offset] ? 0x80 : 0x00 );

   if( timer_ms_triggered[offset] )
   {
      timer_ms_triggered[offset] = false;
      // check if all other interrupt source prevents release
      if( !timer_cycle_triggered[offset] )
      {
         gpio_set_mask( timer_mask[offset] );
      }
   }
}


static inline void event_clear_reset( __unused void *data )
{
   gpio_set_mask( bus_config.mask_reset );
}


static inline void system_reset()
{
   int i;

   if( queue_event_contains( event_clear_reset ) )
   {
      // reset sequence is already initiated
      return;
   }

   // clear some internal states
   for( i = 0; i < 2; ++i )
   {
      timer_cycle_total[i]     = 0;
      timer_cycle_triggered[i] = false;
      timer_ms_triggered[i]    = false;
      // stop ms timers
      (void)cancel_repeating_timer( &timer_ms[i] );
      // clear out ms timer registers
      ram[0xDF18+(i>>1)]       = 0;
      ram[0xDF19+(i>>1)]       = 0;
   }
   watchdog_cycles_total = 0;

   // clear event queue and setup end of reset event
   queue_event_reset();
   queue_event_add( 8, event_clear_reset, 0 );
   // start measurement of cpu speed once every million clocks
   queue_event_add( 9, event_estimate_cpufreq, 0 );

   // setup bank
   set_bank( 1 );

   while( queue_try_remove( &queue_uart_read, &i ) )
   {
      // just loop until queue is empty
   }
   while( queue_try_remove( &queue_uart_write, &i ) )
   {
      // just loop until queue is empty
   }

   // setup serial console
   console_set_uart( 1 );
   // reflect changes from above in control register
   // this needs to be set here, as console_set_* cannot access RAM
   ram[MEM_ADDR_UART_CONTROL] = 0x01;
   // reset Sorbus ID pointer
   sorbus_id_p = sorbus_id;
}


static inline void handle_scratch_mem( uint8_t flags )
{
   // not accessable RAM is used as scratch memory:
   // $D000-$D3FF 1k of scratch RAM, can be copied from/to $0000-$03FF
   uint8_t tmpbuf[0x100];
   int i;
   for( i = 0; i < 4; ++i )
   {
      if( flags & (1 << i) )
      {
         switch( flags & 0xC0 )
         {
            case 0x40:
               memcpy( &ram[0xD000+i*0x100], &ram[i*0x100], 0x100 );
               break;
            case 0x80:
               memcpy( &ram[i*0x100], &ram[0xD000+i*0x100], 0x100 );
               break;
            case 0xC0:
               memcpy( &tmpbuf[0], &ram[i*0x100], 0x100 );
               memcpy( &ram[i*0x100], &ram[0xD000+i*0x100], 0x100 );
               memcpy( &ram[0xD000+i*0x100], &tmpbuf[0], 0x100 );
               break;
         }
      }
   }
}


static inline void event_flash_sync( __unused void *data )
{
   // event handler for flushing dhara journal
   // this event is max 1 time in queue

   dhara_flash_sync();
}


static inline void handle_flash_dma()
{
   uint16_t *lba = (uint16_t*)&ram[MEM_ADDR_ID_LBA];
   uint16_t *mem = (uint16_t*)&ram[MEM_ADDR_ID_MEM];
   int retval = 0;

   // signalize that work was started
   ram[address] = 0x00;
   // sanity checks
   if( !dhara_flash_size )
   {
      // size = 0: no dhara image found
      ram[address] |= 0xF0;
   }
   // filter out bad ranges, removing second line would write protect ROM
   if( (*mem < 0x0004) ||                                    // zeropage I/O
       ((*mem > (0xD000-SECTOR_SIZE)) && (*mem < 0xDF80)) || // $Dxxx I/O
       (*mem > (0x10000-SECTOR_SIZE)) )                      // would go out of bounds
   {
      // DMA would run into I/O which is not possible, only RAM works
      ram[address] |= 0xF1;
   }
   if( *lba >= 0x8000 ) // could also be if( *lba >= dhara_flash_size )
   {
      // only 32768 sectors are available
      ram[address] |= 0xF2;
   }
   if( ram[address] )
   {
      // error, do not continue
      return;
   }

