SvOlli/sorbus/src/rp2040/jam/bus.c
   switch( address & 3 )
   {
      case 0: // read
         retval = dhara_flash_read( *lba, &ram[*mem] );
         if( queue_event_contains( event_flash_sync ) )
         {
            // delay any waiting sync events
            queue_event_cancel( event_flash_sync );
            queue_event_add( DHARA_SYNC_DELAY, event_flash_sync, 0 );
         }
         break;
      case 1: // write
         retval = dhara_flash_write( *lba, &ram[*mem] );
         // drop any waiting sync events, since a new one is created
         queue_event_cancel( event_flash_sync );
         // after ~.02 seconds without additions writes run sync
         queue_event_add( DHARA_SYNC_DELAY, event_flash_sync, 0 );
         break;
      case 3: // trim
         retval = dhara_flash_trim( *lba );
         // drop any waiting sync events, since a new one is created
         queue_event_cancel( event_flash_sync );
         // after ~.02 seconds without additions writes run sync
         queue_event_add( DHARA_SYNC_DELAY, event_flash_sync, 0 );
         break;
      default:
         // unused addresses are treated like RAM
         handle_ramrom();
         break;
   }

   if( retval )
   {
      // report error, do not continue
      ram[address] = 0xF4;
      return;
   }

   // increment pointers
   (*lba)++;
   (*mem) += SECTOR_SIZE;
   // signalize that operation was completed successfully
   ram[address] = 0x80;
}


static inline void handle_io()
{
   static union {
      uint32_t value;
      uint8_t  reg[4];
   } shadow_cycle_count;

   uint8_t data = gpio_get_all() >> bus_config.shift_data;
   bool success;

   if( state & bus_config.mask_rw )
   {
      // I/O read
      switch( address & 0xFF )
      {
         case 0x01: // Sorbus ID
            bus_data_write( *sorbus_id_p );
            if( *sorbus_id_p )
            {
               ++sorbus_id_p;
            }
            else
            {
               sorbus_id_p = sorbus_id;
            }
            break;
         case 0x02: // random
            bus_data_write( rand() & 0xFF );
            break;
         case 0x04: // CPU features
            bus_data_write( cpufeatures[cputype] );
            break;
         case 0x0C: // console UART read
            success = queue_try_remove( &queue_uart_read, &data );
            bus_data_write( success ? data : 0x00 );
            break;
         case 0x0D: // console UART read queue
            bus_data_write( queue_get_level( &queue_uart_read )  );
            break;
         case 0x0F: // console UART write queue
            bus_data_write( queue_get_level( &queue_uart_write )  );
            break;
         case 0x10: // cycle timer for IRQ running
         case 0x11:
         case 0x12:
         case 0x13:
         case 0x14: // cycle timer for NMI running
         case 0x15:
         case 0x16:
         case 0x17: // fall throughs are intended
            timer_cycle_ack();
            break;
         case 0x18: // ms timer for IRQ running
         case 0x19:
         case 0x1A: // ms timer for NMI running
         case 0x1B: // fall throughs are intended
            timer_ms_ack();
            break;
         case 0x20: // is timer for watchdog running
         case 0x21:
         case 0x22:
         case 0x23: // fall throughs are intended
            bus_data_write( watchdog_cycles_total ? 0x80 : 0x00 );
            break;
         case 0x24:
            shadow_cycle_count.value = (uint32_t)_queue_cycle_counter;
            // fall through
         case 0x25:
         case 0x26:
         case 0x27:
            bus_data_write( shadow_cycle_count.reg[address & 3] );
            break;
         /* 0x2C-0x2F used as RAM for BRK routine */
         /* 0x30-0x37 used as RAM for System Monitor */
         /* 0x78-0x7F used as RAM for system vectors */
         /* 0x76 used to store Z register with int macro on 65CE02 */
         default:
            // everything else is handled like RAM by design
            handle_ramrom();
            break;
      }
   }
   else
   {
      // I/O write
      data = bus_data_read();
      switch( address & 0xFF )
      {
         case 0x00: // set bankswitch register for $E000-$FFFF
            set_bank( bus_data_read() );
            handle_ramrom(); // make sure register is mirrored to RAM for read
            break;
         case 0x01: // DEBUG only!
            system_trap( SYSTEM_TRAP );
            break;
         case 0x03: // scratch-1k
            handle_scratch_mem( data );
            break;
         case 0x0B: // UART set configuration
            console_set_uart( data );
            handle_ramrom(); // make sure register is mirrored to RAM for read
            break;
         case 0x0E: // console UART write
            queue_try_add( &queue_uart_write, &data );
            break;
         case 0x10: // setup cycle timer for IRQ
         case 0x11:
         case 0x12:
         case 0x13:
         case 0x14: // setup cycle timer for NMI
         case 0x15:
         case 0x16:
         case 0x17: // fall throughs are intended
            timer_ms_setup( data );
            break;
         case 0x18: // setup ms timer for IRQ
         case 0x19:
         case 0x1A: // setup ms timer for NMI
         case 0x1B: // fall throughs are intended
            timer_ms_setup( data );
            break;
         case 0x20: // setup timer for watchdog
         case 0x21:
         case 0x22:
         case 0x23: // fall throughs are intended
            watchdog_setup( data );
            break;
         /* 0x2C-0x2F used as RAM for BRK routine */
         /* 0x30-0x37 used as RAM for System Monitor */
         /* 0x78-0x7F used as RAM for system vectors */
         case 0x74: // dma read from flash disk
         case 0x75: // dma write to flash disk
         /* 0x76 used to store Z register with int macro on 65CE02 */
         case 0x77: // flash disk trim, no dma address used
            // access is strobe: written data does not matter
            handle_flash_dma();
            break;
         default:
            // everything else is handled like RAM by design
            handle_ramrom();
            break;
      }
   }
}


