SvOlli/sorbus/src/rp2040/jam/bus.c
/******************************************************************************
 * debug functions
 ******************************************************************************/
static const char* debug_handler_name( queue_event_handler_t h )
{
   if( h == event_clear_reset )
   {
      return "event_clear_reset";
   }
   if( h == event_estimate_cpufreq )
   {
      return "event_estimate_cpufreq";
   }
   if( h == event_flash_sync )
   {
      return "event_flash_sync";
   }
   if( h == event_timer_cycle )
   {
      return "event_timer_cycle";
   }
   if( h == event_watchdog )
   {
      return "event_watchdog";
   }
   return "(unknown?)";
}


static void debug_info_eventqueue( char *buffer, size_t size )
{
   int printed;
   queue_event_t *event;
   int i = 0;
   const char *timer_names[2] = { "NMI", "IRQ" };

   printed = snprintf( buffer, size,
                       "cycle counter:   %016llx\n"
                       "next timerstamp: %016llx\n"
                       , _queue_cycle_counter
                       , _queue_next_timestamp
                     );
   buffer += printed;
   size   -= printed;

   for( i = 0; i < count_of(timer_names); ++i )
   {
      printed = snprintf( buffer, size,
                          "timer%d (%s):    id=%d us=%lld d=%u\n"
                          , i, timer_names[i]
                          , timer_ms[i].alarm_id, timer_ms[i].delay_us
                          , (uint32_t)timer_ms[i].user_data
                        );
      buffer += printed;
      size   -= printed;
      if( size <= 0 )
      {
         /* buffer is full */
         return;
      }
   }

   i = 0;
   for( event = _queue_next_event; event; event = event->next )
   {
      printed = snprintf( buffer, size,
                          "event %02d: %016llx:%p:%-24s:%08x"
                          , i++
                          , event->timestamp
                          , event->handler
                          , debug_handler_name( event->handler )
                          , event->data
                        );
      buffer += printed;
      size   -= printed;
      if( size <= 0 )
      {
         /* buffer is full */
         return;
      }
   }
}


static void debug_info_clocks( char *buffer, size_t size )
{
   uint f_clk_sys  = frequency_count_khz(CLOCKS_FC0_SRC_VALUE_CLK_SYS);
   uint f_clk_peri = frequency_count_khz(CLOCKS_FC0_SRC_VALUE_CLK_PERI);
   uint time_hz = (double)1000000.0 / ((double)(time_per_mcc) / CLOCKS_PER_SEC / 10000);

   check_cpu_is_halted();

   snprintf( buffer, size,
             "  CLK_SYS: %3d.%03d   MHz\n"
             " CLK_PERI: %3d.%03d   MHz\n"
             "%9s: %3d.%06dMHz"
             , f_clk_sys / 1000, (f_clk_sys % 1000)
             , f_clk_peri / 1000, (f_clk_peri % 1000)
             , cputype_name( cputype ), time_hz / 1000000, time_hz % 1000000 );
}


static void debug_info_heap( char *buffer, size_t size )
{
   extern char __StackLimit, __bss_end__;
   struct mallinfo m = mallinfo();
   uint32_t total_heap = &__StackLimit  - &__bss_end__;
   uint32_t free_heap = total_heap - m.uordblks;

   snprintf( buffer, size,
             "heap total: %6d\n"
             "      free: %6d\n"
             "   minimum: %6d"
             , total_heap, free_heap, mf_checkheap() );
}


const void debug_info_sysvectors( char *buffer, size_t size )
{
   snprintf( buffer, size,
             "UVBRK:%04X UVNBI:%04X\n"
             "UVNMI:%04X UVIRQ:%04X\n"
             "B0NMI:%04X B0IRQ:%04X"
             , *((uint16_t*)&ram[0xDF78])
             , *((uint16_t*)&ram[0xDF7C])
             , *((uint16_t*)&ram[0xDF7A])
             , *((uint16_t*)&ram[0xDF7E])
             , *((uint16_t*)&ram[0xFFFA])
             , *((uint16_t*)&ram[0xFFFE]) );
}


static void debug_info_internaldrive( char *buffer, size_t size )
{
   dhara_flash_info_t dhara_info;
   uint16_t *lba = (uint16_t*)&ram[MEM_ADDR_ID_LBA];
   uint16_t *mem = (uint16_t*)&ram[MEM_ADDR_ID_MEM];

   check_cpu_is_halted();

   dhara_flash_info( &dhara_info );
   uint64_t hw_size  = dhara_info.erase_cells * dhara_info.erase_size;
   uint64_t lba_size = dhara_info.sectors * dhara_info.sector_size;

   snprintf( buffer, size,
      /*01*/ "hw sector size:  %08x (%d)\n"
      /*02*/ "hw num sectors:  %08x (%d)\n"
      /*03*/ "hw size:         %6.2fMB\n"
      /*04*/ "page size:       %08x (%d)\n"
      /*05*/ "pages:           %08x (%d)\n"
      /*06*/ "lba sector size: %08x (%d)\n"
      /*07*/ "lba num sectors: %08x (%d)\n"
      /*08*/ "lba size:        %6.2fMB\n"
      /*09*/ "gc ratio         %08x (%d)\n"
      /*10*/ "read status:     %d\n"
      /*11*/ "read error:      %s\n"
      /*12*/ "ID_LBA ($DF70):  %04x (sector used for next transfer)\n"
      /*13*/ "ID_MEM ($DF72):  %04x (memory used for next transfer)\n"
      /*01*/ , dhara_info.erase_size, dhara_info.erase_size
      /*02*/ , dhara_info.erase_cells, dhara_info.erase_cells
      /*03*/ , (float)hw_size / (1024*1024)
      /*04*/ , dhara_info.page_size, dhara_info.page_size
      /*05*/ , dhara_info.pages, dhara_info.pages
      /*06*/ , dhara_info.sector_size, dhara_info.sector_size
      /*07*/ , dhara_info.sectors, dhara_info.sectors
      /*08*/ , (float)lba_size / (1024*1024)
      /*09*/ , dhara_info.gc_ratio, dhara_info.gc_ratio
      /*10*/ , dhara_info.read_status
      /*11*/ , dhara_strerror( dhara_info.read_errcode )
      /*12*/ , *lba
      /*13*/ , *mem
   );
}


/******************************************************************************
 * public functions
 ******************************************************************************/
void system_cpu_detect()
{
   cputype = cpu_detect( false );
retry:
   if( cputype == CPU_ERROR )
   {
      bool success;
      uint8_t data;
      printf( "  cpu could not be detected, retrying (SPACE for debug)\r" );
      success = queue_try_remove( &queue_uart_read, &data );
      if( success && (data == ' ') )
      {
         cputype = cpu_detect( true );
         printf( "power jumper set?\n" );
      }

      goto retry;
   }
}


void bus_run()
{
   bus_init();
   system_cpu_detect();
   system_init();
   system_reboot();

