SvOlli/sorbus/src/rp2040/jam/bus.c
   // when not running as speed test run main loop forever
   for(;;)
   {
      // check if internal events need processing
      queue_event_process();

      // LOW ACTIVE
      if( !(state & bus_config.mask_reset) )
      {
         system_reset();
      }

      // done: set clock to high
      gpio_set_mask( bus_config.mask_clock );

      // bus should be still valid from clock low
      state = gpio_get_all();

      // setup bus direction so I/O can settle
      if( state & bus_config.mask_rw )
      {
         // read from memory and write to bus
         gpio_set_dir_out_masked( bus_config.mask_data );
         // note to future self: check if there's a better way for
         // external i/o then to set the GPIOs to write for a brief time
      }
      else
      {
         // read from bus and write to memory write
         gpio_set_dir_in_masked( bus_config.mask_data );
      }

      address = ((state & bus_config.mask_address) >> bus_config.shift_address);

      // setup data
      //if( (address & 0xFF00) == 0xDF00 )
      if( (address >> 8) == 0xDF ) // this is faster
      {
         // internal I/O
         handle_io();
      }
      //else if( (address <= 0x0003) || ((address & 0xF000) == 0xD000) )
      else if( (address <= 0x0003) || ((address >> 12) == 0xD) )
      {
         // external i/o: keep hands off the bus
         gpio_set_dir_in_masked( bus_config.mask_data );
      }
      else
      {
         handle_ramrom();
      }

      // log last states
      if( state & bus_config.mask_rdy )
      {
         // state is not valid on the data when RP2040 is writing
         buslog_states[buslog_index++ & (BUSLOG_SIZE-1)] = gpio_get_all();
      }

      // done: set clock to low
      gpio_clr_mask( bus_config.mask_clock );
   }
}


void system_init()
{
   memset( &ram[0x0000], 0x00, sizeof(ram) );
   memcpy( &rom[0x0000], (const void*)FLASH_KERNEL_START, sizeof(rom) );
   srand( get_rand_32() );
   dhara_flash_size = dhara_flash_init();
   disass_set_cpu( cputype );
}


void system_reboot()
{
   // clear out cpu state log
   memset( &buslog_states[0], 0, sizeof(buslog_states) );

   // make sure that RDY line is high
   gpio_set_mask( bus_config.mask_rdy | bus_config.mask_irq | bus_config.mask_nmi );

   // pull reset line to system_reset gets executed
   gpio_clr_mask( bus_config.mask_reset );
}


uint8_t debug_banks()
{
   return sizeof(rom) >> 13; // ROMSIZE / 0x2000;
}


uint8_t debug_peek( uint8_t bank, uint16_t addr )
{
   if( addr < 0xE000 )
   {
      return ram[addr];
   }
   if( (bank > 0) && (bank <= debug_banks()) )
   {
      /* assembling address in ROM array is a bit more complicated */
      return rom[((bank-1) << 13) | (addr & 0x1FFF)];
   }
   else
   {
      /* bank0: RAM under ROM */
      return ram[addr];
   }
}


void debug_poke( uint8_t bank, uint16_t addr, uint8_t value )
{
   if( (addr < 0xE000) || !bank )
   {
      ram[addr] = value;
   }
}


const char *debug_get_info( debug_info_t page )
{
   static char buffer[1024] = { 0 };

   buffer[0] = '\0';
   switch( page )
   {
      case DEBUG_INFO_HEAP:
         debug_info_heap( &buffer[0], sizeof(buffer)-1 );
         break;
      case DEBUG_INFO_CLOCKS:
         debug_info_clocks( &buffer[0], sizeof(buffer)-1 );
         break;
      case DEBUG_INFO_SYSVECTORS:
         debug_info_sysvectors( &buffer[0], sizeof(buffer)-1 );
         break;
      case DEBUG_INFO_INTERNALDRIVE:
         debug_info_internaldrive( &buffer[0], sizeof(buffer)-1 );
         break;
      case DEBUG_INFO_EVENTQUEUE:
         debug_info_eventqueue( &buffer[0], sizeof(buffer)-1 );
         break;
      default:
         break;
   }
   return &buffer[0];
}


void debug_disassembler()
{
   static uint16_t lastaddr = 0x0400;
   uint16_t addr = 0;
   int count = 0;

   check_cpu_is_halted();

   for(;;)
   {
      printf( "%s disass ($%04X): ", cputype_name( cputype ), lastaddr );
      int32_t getaddr = get_16bit_address( lastaddr );
      printf( "\n" );
      if( getaddr < 0 )
      {
         return;
      }

      addr = (uint16_t)(getaddr & 0xFFFF);
      for( count = 0; count < 16; ++count )
      {
         disass_show( DISASS_SHOW_ADDRESS | DISASS_SHOW_HEXDUMP );
         puts( disass( addr, get_memory(addr), get_memory(addr+1), get_memory(addr+2), get_memory(addr+3) ) );
         //printf( "%s ; %d\n",
         //   disass( addr, get_memory(addr), get_memory(addr+1), get_memory(addr+2), get_memory(addr+3) ),
         //   disass_bytes( get_memory(addr) );
         addr += disass_bytes( get_memory(addr) );
      }
      lastaddr = addr;
   }
}


void debug_raw_backtrace()
{
   printf( "\nTRACE_START %s\n", cputype_name( cputype ) );
   for( int i = buslog_index; i < (buslog_index + BUSLOG_SIZE); ++i )
   {
      printf( "%08x\n", buslog_states[i & (BUSLOG_SIZE-1)] );
   }
   printf( "TRACE_END\n" );
}


void debug_get_backtrace( cputype_t *cpu, uint32_t **trace, uint32_t *entries, uint32_t *start )
{
   *cpu     = cputype ? cputype : CPU_6502;
   *trace   = &buslog_states[0];
   *entries = BUSLOG_SIZE;
   *start   = buslog_index & (BUSLOG_SIZE)-1;
}
